In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('D:\\MyProjects\\AAIE_test\\1_data\\1_1_raw_data\\sample.csv')

In [7]:
df

   student_id    name
0         101   apple
1         102  banana

In [8]:
df['name_upper'] = df['name'].str.upper()

In [9]:
df

   student_id    name name_upper
0         101   apple      APPLE
1         102  banana     BANANA